src/cf/Documents/GDS_ВыгрузкаГСМиТЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_ВыгрузкаГСМиТЖ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийСТехническимиЖидкостями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийСТехническимиЖидкостями</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоливПоАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоливПоТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоливПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/GDS_ВыгрузкаГСМиТЖ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьЗавершение(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	                                            
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
		
	Если Объект.ГСМ.Количество() > 0 Тогда
		ОписаниеОповещение = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещение,"Вы действительно хотите перезаполнить табличную часть?",РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	Иначе
		ЗаполнитьНаСервере();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗаполнитьНаСервере()
	
	Если Объект.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.РасходВРаботе Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	уатТС.Ссылка КАК ТС,
			|	уатТС.Модель.ОсновноеТопливо КАК ГСМ
			|ПОМЕСТИТЬ ВсеТС
			|ИЗ
			|	Справочник.уатТС КАК уатТС
			|ГДЕ
			|	НЕ уатТС.ПометкаУдаления
			|	И НЕ уатТС.ЭтоГруппа
			|
			|СГРУППИРОВАТЬ ПО
			|	уатТС.Ссылка,
			|	уатТС.Модель.ОсновноеТопливо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеТС.ТС,
			|	ВсеТС.ГСМ,
			|	МеКаМи_ИтоговыеСведенияПЛОбороты.РасходПоФактуОборот КАК Количество
			|ПОМЕСТИТЬ ВсеТСсКоличеством
			|ИЗ
			|	ВсеТС КАК ВсеТС
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МеКаМи_ИтоговыеСведенияПЛ.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК МеКаМи_ИтоговыеСведенияПЛОбороты
			|		ПО ВсеТС.ТС = МеКаМи_ИтоговыеСведенияПЛОбороты.ТС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеТСсКоличеством.ТС,
			|	ВсеТСсКоличеством.ГСМ,
			|	СУММА(ВсеТСсКоличеством.Количество) КАК Количество,
			|	уатМестонахождениеТССрезПоследних.Подразделение,
			|	уатМестонахождениеТССрезПоследних.Колонна КАК ПУ,
			|	ВсеТСсКоличеством.ТС.ОсновноеСредство КАК ОС
			|ИЗ
			|	ВсеТСсКоличеством КАК ВсеТСсКоличеством
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&КонецПериода, ) КАК уатМестонахождениеТССрезПоследних
			|		ПО ВсеТСсКоличеством.ТС = уатМестонахождениеТССрезПоследних.ТС
			|ГДЕ
			|	ВсеТСсКоличеством.Количество > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеТСсКоличеством.ГСМ,
			|	ВсеТСсКоличеством.ТС,
			|	уатМестонахождениеТССрезПоследних.Подразделение,
			|	уатМестонахождениеТССрезПоследних.Колонна,
			|	ВсеТСсКоличеством.ТС.ОсновноеСредство";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТЗ = РезультатЗапроса.Выгрузить();
		
		Объект.ГСМ.Загрузить(ТЗ);
	Иначе
		Если ЗначениеЗаполнено(Объект.Склад) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.ГСМ,
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.ТС,
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.ТС.ОсновноеСредство КАК ОС,
				|	уатМестонахождениеТССрезПоследних.Подразделение,
				|	уатМестонахождениеТССрезПоследних.Колонна КАК ПУ,
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.Склад.СкладВБУ КАК СкладВБУ,
				|	СУММА(МеКаМи_СписаниеТехническихЖидкостейОстатки.КоличествоОстаток) КАК Количество
				|ИЗ
				|	РегистрНакопления.МеКаМи_СписаниеТехническихЖидкостей.Остатки(&НаДату, ) КАК МеКаМи_СписаниеТехническихЖидкостейОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&НаДату, ) КАК уатМестонахождениеТССрезПоследних
				|		ПО МеКаМи_СписаниеТехническихЖидкостейОстатки.ТС = уатМестонахождениеТССрезПоследних.ТС
				|ГДЕ
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.Склад = &Склад
				|	И МеКаМи_СписаниеТехническихЖидкостейОстатки.КоличествоОстаток > 0
				|
				|СГРУППИРОВАТЬ ПО
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.ТС,
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.ГСМ,
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.ТС.ОсновноеСредство,
				|	уатМестонахождениеТССрезПоследних.Колонна,
				|	уатМестонахождениеТССрезПоследних.Подразделение,
				|	МеКаМи_СписаниеТехническихЖидкостейОстатки.Склад.СкладВБУ";
			
			Запрос.УстановитьПараметр("НаДату", Объект.Дата);
			Запрос.УстановитьПараметр("Склад", Объект.Склад);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ТЗ = РезультатЗапроса.Выгрузить();
			
			Объект.ГСМ.Загрузить(ТЗ);
		Иначе
			Сообщить("Не указан СКЛАД!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.АвторизованныйПользователь;
		Объект.Организация	 = GDS_ДополнительныеФункции.ВернутьОрганизацию();
		Объект.Дата			 = КонецДня(ТекущаяДата());
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтправитьВБухгалтериюНаСервере()

	Если GDS_ДополнительныеФункции.ПроверкаНаРабочуюБД() Тогда
		СоединениеWS = GDS_ФункцииОбменаЧерезCOM.ПолучитьДанныеОWS();
		
		ТекстОшибки = "";
		
		XML_Строка = GDS_ФункцииОбменаЧерезCOM.СерилизацияДокумента(Объект);
			
		Данные = Новый ХранилищеЗначения(XML_Строка, Новый СжатиеДанных(9));
			
		Попытка
			Результат = СоединениеWS.ПринятьДанные(Данные,ТекстОшибки);
		Исключение
			GDS_ДополнительныеФункции.ПослатьПочтовоеСообщение("Документ Списание ГСМ/Тех. жидкостей не выгрузился в Бухгалтерию","Не удалось выгрузить документ Списание ГСМ из УАТ. Требуется вмешательство!"+Символы.ПС+Объект.Ссылка,"loginovvf@mecamineft.com","novoselovss@mecamineft.com");	
		КонецПопытки;
			
		если Результат <> 1 ИЛИ Результат <> Истина тогда
			Сообщить("Не удалось выгрузить документ Списание ГСМ/Тех. жидкости из УАТ",СтатусСообщения.ОченьВажное);
		Иначе
			Объект.Отправлен = Истина;
		конецЕсли;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВБухгалтерию(Команда)
	
	Если Объект.ГСМ.Количество() > 0 Тогда
		ОписаниеОповещение = Новый ОписаниеОповещения("ОтправитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещение,"Вы действительно хотите отправить в бухгалтерию?",РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗавершение(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	                                            
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если НЕ Объект.Проведен Тогда
			ПоказатьПредупреждение(,"Перед отправкой необходимо провести документ!",,"Внимание!!!");
			Возврат;
		КонецЕсли;
		//++ Проверка на пустые строчки в ТЧ - ГСМ	
		Если ПроверимПустыеОС() Тогда
			ПоказатьПредупреждение(,"Перед отправкой необходимо заполнить ОС!",,"Внимание!!!");
			Возврат;	
		КонецЕсли;
		//--
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийСТехническимиЖидкостями.РасходВРаботе") Тогда
			Если ПроверимПометкуУдаленияУСклада() Тогда
				ПоказатьПредупреждение(,"Склад помечен на удаление в Бухгалтерии!",,"Внимание!!!");
				Возврат;	
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
				ПоказатьПредупреждение(,"Не заполнен склад Бухгалтерии!",,"Внимание!!!");
				Возврат;	
			КонецЕсли;
		КонецЕсли;
		
		ОтправитьВБухгалтериюНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверимПустыеОС()
	
	СтруктураДляПоиска = Новый Структура("ОС", Справочники.ОсновныеСредства.ПустаяСсылка());
	
	ТабличнаяЧастьДок = Объект.ГСМ; 
	//Получаем список строк соответсвтвующих отбору. 
	
	МассивСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
	
	Если МассивСтрок.Количество() > 0 Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

Функция ПроверимПометкуУдаленияУСклада()
	
	Возврат Объект.Склад.СкладВБУ.ПометкаУдаления;
	
КонецФункции

&НаСервере
Функция ОпределитьВидОперации()

	Возврат Объект.ВидОперации = Перечисления.уатВидыОперацийСТехническимиЖидкостями.уатВидыОперацийСТехническимиЖидкостями;
	
КонецФункции

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	Если ОпределитьВидОперации() Тогда
		Элементы.Склад.Видимость = Истина;
		Элементы.СкладВБУ.Видимость = Истина;
		Элементы.ГСМ.Заголовок = "Масло/Тех.жидкость";
	Иначе
		Элементы.Склад.Видимость = Ложь;
		Элементы.СкладВБУ.Видимость = Ложь;
		Элементы.ГСМ.Заголовок = "ГСМ";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьФорму();
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Объект.Дата = КонецДня(Дата(Текст));
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.уатВидыОперацийСТехническимиЖидкостями.РасходВРаботе") Тогда
		Если ПроверимПометкуУдаленияУСклада() Тогда
			ПоказатьПредупреждение(,"Склад помечен на удаление в Бухгалтерии!",,"Внимание!!!");
			Возврат;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
